---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemHookStartOrient
source: html/48664cd4-4226-ef4a-86c0-3e46a810a105.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemHookStartOrient Property

"Hook Orientation At Start"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemHookStartOrient { get; }
```